ToolOpenFoamExample4/0/p.org
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha;
}

//kg per square meter
// # property           SI unit
// 0 mass               kg
// 1 length             m
// 2 time               s
// 3 temperature        K
// 4 quantity           kg.mole 
// 5 current            A
// 6 luminous intensity cd
dimensions      [1 2 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftWall
    {
        type            zeroGradient;
    }

    rightWall
    {
        type            zeroGradient;
    }

    lowerWall
    {
        type            zeroGradient;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    defaultFaces
    {
        type            empty;
    }
}